In [7]:
import pandas as pd
df_sales=pd.read_csv(r'./t_sales_sum.csv')
df_sales=df_sales.drop_duplicates()
print(df_sales.head(10))
print(len(df_sales))
df_sales.to_csv(r'./Droped_t_sales_sum.csv', index=None)
df_sales.head()

           dt  shop_id  sale_amt_3m
0  2016-12-31     2143     72983.09
1  2016-07-31     2143    106943.03
2  2016-08-31     2143    183723.36
3  2016-09-30     2143    235568.57
4  2016-11-30     2143     80115.29
5  2016-12-31     1559     67228.29
6  2016-08-31     1559    267183.30
7  2017-01-31     1559     83264.96
8  2016-10-31     1559    123020.74
9  2016-12-31     1296     24583.73
24000

           dt  shop_id  sale_amt_3m
0  2016-12-31     2143     72983.09
1  2016-07-31     2143    106943.03
2  2016-08-31     2143    183723.36
3  2016-09-30     2143    235568.57
4  2016-11-30     2143     80115.29